//EXP1? EXE2: EXP3
//EXP1，EXP2和EXP3是表达式，注意冒号的用法和位置。
//操作符“?”作用是这样的，在计算EXP1之后，如果数值为True，则计算EXP2,
//并将结果作为整个表达式的数值；如果E XP1的值为Flase，则计算EXP3,
//并以它的结果作为整个表达式的值.

int main() 
{
	int n;
	scanf("%d", &n);
	(n <= 100000) ? printf("%d", n/10) : 0;
	(n > 100000 && n<=200000) ? printf("%d", (n-100000)/100*8+10000) : 0;
	(n > 200000 && n <= 400000) ? printf("%d", (n - 200000) / 20 + 18000) : 0;
	(n > 400000 && n <= 600000) ? printf("%d", (n - 400000) / 100*3 + 28000) : 0;
	(n > 600000 && n <= 1000000) ? printf("%d", (n - 600000) / 50 + 34000) : 0;
	(n > 1000000) ? printf("%d", (n - 1000000) / 100  + 42000) : 0;
	return 0;
}